Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/education/primary_and_post_primary_education/going_to_post_primary_school/types_of_post_primary_school.html.txt.tmx
Source language: en
Languages: ga

source: Types of post-primary school
ga: Cineálacha éagsúla scoileanna iarbhunoideachais

source: There are a number of different types of post-primary school in the Irish education system, which allow a measure of choice to parents
ga: Tá cineálacha éagsúla scoileanna iarbhunoideachais sa chóras oideachais, rud a thugann roghanna áirithe do thuismitheoirí

source: The second-level sector comprises voluntary secondary schools, community schools and comprehensive schools, which are generally denominational (for example, Roman Catholic or Protestant)
ga: Tá meánscoileanna deonacha, pobalscoileanna agus scoileanna cuimsitheacha san earnáil dara leibhéil agus tá an formhór acu sin sainchreideamhach (Caitliceach Rómhánach nó Protastúnach, mar shampla)

source: Vocational schools and community colleges are non-denominational
ga: Is scoileanna neamh-shainchreidmheacha iad na gairmscoileanna agus na coláistí pobail

source: Voluntary secondary schools are privately owned and managed
ga: Úinéireacht agus bainistíocht phríobháideach a bhíonn i gceist i gcás meánscoileanna deonacha

source: They are under the trusteeship of religious communities, boards of governors or individuals
ga: Bíonn siad faoi iontaobhas cuallachtaí reiligiúnacha, boird ghobharnóirí nó daoine príobháideacha

source: The Education Act 1998 requires secondary schools to have boards of management that include parent and teacher representatives
ga: Éilíonn An tAcht Oideachais 1998 go mbeidh boird bhainistíochta ag meánscoileanna agus ionadaithe ag tuismitheoirí agus ag múinteoirí orthu

source: The national organisation representing the boards of management of these schools is the Joint Managerial Body
ga: Is é Comhchoiste na mBainisteoirí eagraíocht ionadaíochta bhord bainistíochta na scoileanna seo

source: Voluntary secondary schools may be fee-paying or non-fee-paying
ga: Scoileanna táillí iad cuid de na meánscoileanna deonacha agus scoileanna gan táillí an chuid eile díobh

source: Fee-paying schools are not eligible for Government funding to assist with running costs
ga: Níl scoileanna táillí i dteideal maoiniú a fháil ón rialtas le cabhrú leo maidir lena gcostais reatha

source: Non-fee-paying schools that participate in the free education scheme get a range of grants and subsidies from the State
ga: Faigheann na scoileanna gan táillí atá páirteach sa scéim saor-oideachais réimse deontas agus fóirdheontas ón Stát

source: In the past, voluntary secondary schools provided a more academic education but increasingly, they provide a range of academic, practical and vocational subjects
ga: Bhíodh oideachas de chineál ní b’acadúla á sholáthar ag meánscoileanna deonacha san am atá thart ach tá níos mó acu ag cur meascáin d'ábhair acadúla, phraiticiúla agus ghairme ar fáil anois

source: Vocational schools and community colleges
ga: Gairmscoileanna agus coláistí pobail

source: Vocational schools and community colleges are owned by the local Education and Training Board (ETB)
ga: Is leis na Boird Oideachais agus Oiliúna (BOO) áitiúla na gairmscoileanna agus na coláistí pobail

source: The boards of management for these schools are sub-committees of the ETB
ga: Fochoistí de chuid na BOO iad boird bhainistíochta na scoileanna seo

source: Membership of the boards include ETB representatives and parent, teacher and community representatives
ga: Bíonn ionadaithe de chuid na BOO, na dtuismitheoirí, na múinteoirí agus ionadaithe pobail ar na boird seo

source: Vocational schools and community colleges are largely funded by the Department of Education and Skills
ga: Is í an Roinn Oideachais agus Scileanna a chuireann an chuid is mó den mhaoiniú ar fáil le haghaidh gairmscoileanna agus coláistí pobail

source: Initially, these schools were orientated towards providing a technical education and developing manual skills
ga: Leagadh na scoileanna seo béim ar oideachas teicniúil agus scileanna láimhe ar dtús ach bíonn réimse leathan d’ábhair acadúla agus phraiticiúla á sholáthar acu de ghnáth anois

source: Today, they generally provide a wide range of both academic and practical subjects. Vocational schools are also the main providers of adult education and community education courses
ga: Lena chois sin is iad na gairmscoileanna a chuireann formhór na gcúrsaí aos-oideachais agus oideachas pobail ar fáil

source: The national representative body for the Education and Training Boards is the Education and Training Boards Ireland
ga: Is é Boird Oileachais agus Oilina Éirean eagraíocht náisiúnta ionadaíochta na Boird Oideachais agus Oiliúna

source: Community and comprehensive schools
ga: Scoileanna pobail agus scoileanna cuimsitheacha

source: Community and comprehensive schools were established in the 1960s in order to provide a broad curriculum for all the young people in a community
ga: Bunaíodh na scoileanna pobail agus na scoileanna cuimsitheacha sna 1960idí chun curaclam leathan a chur ar fáil don óige go léir i bpobal

source: Many of these schools were established as the result of the amalgamation of voluntary secondary and vocational schools
ga: Bunaíodh a lán acu de thoradh nascadh meánscoileanna deonacha agus gairmscoileanna

source: They offer a wide range of both academic and vocational subjects
ga: Cuireann siad réimse leathan d’ábhair acadúla agus ábhair ghairme ar fáil

source: They are managed by boards of management which are representative of local interests
ga: Bíonn ionadaithe na bpáirtithe leasmhara áitiúla ar a mboird bhainistíochta

source: The schools are financed entirely by the Department of Education and Skills
ga: An Roinn Oideachais agus Scileanna a chuireann an maoiniú go léir ar fáil dóibh

source: The representative body for these schools is the Association of Community and Comprehensive Schools
ga: Is é Cumann na Scoileanna Pobail is Cuimsitheacha eagraíocht ionadaíochta náisiúnta na scoileanna seo

source: The Education Act 1998 makes certain requirements of each secondary school’s board of management:
ga: Tá foráil san Acht Oideachais 1998 a chuireann dualgais áirithe ar bhord bainistíochta gach meánscoile:

source: The board of management of each school must devise its own admissions policy and make this information available to parents
ga: Caithfidh bord bainistíochta gach scoile beartas iontrála dá chuid féin a cheapadh agus an fhaisnéis seo a chur ar fáil do thuismitheoirí

source: Such policies should include the provision of services for children with special educational needs and respect for the rights of parents to send their children to a school of their choice
ga: Caithfidh soláthar seirbhísí le haghaidh páistí a bhfuil riachtanais speisialta oideachais acu a bheith mar chuid de na beartais seo agus ní mór aitheantas a thabhairt do chearta tuismitheoirí a leanaí a chur chuig scoil a roghnaíonn siad féin

source: Parents should know the criteria used in selecting or rejecting children for enrolment
ga: Ba chóir go mbeadh a fhios ag tuismitheoirí céard iad na critéir a úsáidtear chun paistí a chur ar an rolla nó diúltú dóibh

source: Schools are allowed to following their religious and educational philosophy when developing an admissions policy
ga: Tá sé de chead ag scoileanna a gcreideamh agus a bhfealsúnacht oideachais a leanúint agus iad ag ceapadh a mbeartas iontrála

source: They cannot however refuse admittance to a student unless that refusal is in accordance with their stated policy and does not discriminate under the Equal Status Acts 2000–2011
ga: Ní féidir leo diúltú do dhalta mura mbíonn an diúltú sin ar aon dul leis an mbeartas atá fógartha acu agus nach ndéanann sé leithcheal ar aon duine faoi na hAchtanna um Stádas Comhionann 2000–2011

source: Parents can appeal a decision to refuse enrolment to the Department of Education and Skills
ga: Féadfaidh tuismitheoirí achomharc a dhéanamh chun na Roinne Oideachais agus Scileanna in aghaidh diúltú páiste a chur ar an rolla

source: The appeal must be made within 42 calendar days from the date that the decision of the board of management was notified to the parents/guardians
ga: Ní mór an t-achomharc a dhéanamh laistigh de 42 lá féilire ón am a cuireadh cinneadh an bhoird bhainistíochta in iúl do na tuismitheoirí nó na caomhnóirí

source: The board of management must produce a school plan
ga: Ní mór don bhord bainistíochta plean scoile a chur ar fáil

source: This sets out the long-term vision of the school, its goals and action plans, and its policies and procedures
ga: Leagann sé sin síos fís fhadtéarmach na scoile, a cuspóirí agus a pleananna gníomhaíochta mar aon lena beartais agus a nósanna imeachta

source: It includes information on the school’s curriculum, resources and facilities, and opportunities for students and others to participate in the school community
ga: Insíonn sé faoi churaclam na scoile, na hacmhainní agus na háiseanna atá aici agus na deiseanna atá ag daltaí agus ag daoine eile páirt a ghlacadh i bpobal na scoile

source: It should also contain the school’s objectives relating to equality of access, participation in the school and provision for students with disabilities or who have other special educational needs
ga: Ba chóir dó a insint freisin faoina cuspóirí maidir le comhionannas rochtana, comhpháirtíocht sa scoil agus an soláthar a dhéantar le haghaidh daltaí le míchumais nó a bhfuil riachtanais speisialta oideachais acu

source: Almost all schools will have a written code of discipline or student behaviour and a set of rules with which pupils are expected to comply
ga: Tá cód smachta nó cód iompair daltaí ag beagnach gach scoil mar aon le liosta rialacha a bhfuiltear ag súil go ngéillfidh na daltaí dóibh

source: The majority of post-primary schools in Ireland do not charge fees
ga: Scoileanna gan táille iad formhór na scoileanna iarbhunoideachais in Éirinn

source: Non-fee-paying voluntary secondary schools receive grants from the Department of Education and Skills to assist with their running costs. Grants are based on the number of pupils attending the school
ga: Cuireann an Roinn Oideachais agus Scileanna deontais ar fáil le haghaidh na scoileanna iarbhunoideachais gan táille le cabhrú leo íoc as a gcostais reatha

source: Schools rated as disadvantaged receive an additional grant per pupil
ga: Is ar líon na ndaltaí atá ag freastal ar an scoil a áirítear na deontais seo

source: Some voluntary secondary schools are fee-paying but the majority participate in the free education scheme
ga: Tugtar deontas breise in aghaidh gach dalta do Scoileanna a mheastar a bheith faoi mhíbhuntáiste

source: This means they benefit from additional state allowances and capitation grants
ga: Scoileanna le táillí iad cuid de na meánscoileanna deonacha ach is scoileanna gan táillí an formhór acu, rud a chiallaíonn gur féidir leo deontais caipitíochta agus liúntais eile a fháil ón stát

source: Community and comprehensive schools and vocational schools are all funded on the basis of an annual budget
ga: Is mar bhuiséad bliantúil a chuirtear maoiniú ar fáil le haghaidh pobalscoileanna agus scoileanna cuimsitheacha

source: There are a number of fee-paying secondary schools
ga: Tá roinnt meánscoileanna ann a éilíonn táillí

source: Fee-paying schools do not receive any state grants towards their running costs although the State pays the salaries of all teachers working in recognised schools
ga: Ní chuireann an Stát aon deontas ar fáil maidir le costais reatha i gcás na scoileanna táille ach íocann sé tuarastal na múinteoirí go léir i scoileanna aitheanta

source: Fees are set each year by the board of management of the school, subject to approval by the governing body
ga: Is iad na boird bhainistíochta a shocraíonn méid na dtáillí gach bliain agus déanann na comhlachtaí rialaithe iad a fhaomhadh

source: Even students attending non-fee-paying schools must pay for books and examination fees
ga: Caithfidh na daltaí íoc as leabhair agus táillí scrúduithe fiú sna scoileanna gan táille

source: In addition, there are other costs, such as school uniform
ga: Lena chois sin bíonn costais eile mar éide scoile i gceist freisin

source: There are various schemes to help low-income families meet the costs of schooling
ga: Tá scéimeanna éagsúla le cabhrú le teaghlaigh ar ioncam íseal déileáil le costais scolaíochta

source: For further information on admission and enrolment policies for post-primary schools in your area, check the list of post-primary schools in your area available on the website of the Department of Education and Skills
ga: Féach ar liosta na scoileanna iarbhunoideachais i do cheantar atá ar fáil ar láithreán gréasáin na Roinne Oideachais agus Scileanna chun breis eolais a fháil faoi na beartais maidir le hiontráil agus cur ar an rolla atá ag na scoileanna iar-bhunoideachais i do cheantar

source: Then you should contact the post-primary school of your choice
ga: Ba chóir duit dul i dteagmháil leis an scoil iarbhunoideachais is rogha leat ansin
